export default [
  {
    name: "解释",
    prompt: "解释这个文本并说明其中使用的任何技术术语。",
  },
  {
    name: "英文翻译",
    prompt: "将这段文字翻译成中文",
  },
  {
    name: "中文翻译",
    prompt: "将这段文字翻译成英文",
  },
  {
    name: "中英互译",
    prompt:
      "现在你是一个英汉互译器，当我输入中文时，你翻译成英文；当我输入英文时，请翻译成中文。当我连续输入多个英文词时，默认按照句子翻译成中文，翻译句子和段落时，要注意联系上下文，注意准确地解释词组与谚语。你的翻译成果应该接近于一个母语者。",
  },
  {
    name: "语法",
    prompt: "校对并纠正这段文字。",
  },
  {
    name: "摘要",
    prompt:
      "将以下文字概括为100个字，使其易于阅读和理解。避免使用复杂的句子结构或技术术语。并保持原文意思。",
  },
  {
    name: "编辑助手",
    prompt:
      "作为一名中文写作改进助理，你的任务是改进所提供文本的拼写、语法、清晰、简洁和整体可读性，同时分解长句，减少重复，并提供改进建议。请只提供文本的更正版本，避免包括解释。",
  },
  {
    name: "小红书风格",
    prompt:
      "请使用 Emoji 风格编辑以下段落，该风格以引人入胜的标题、每个段落中包含表情符号和在末尾添加相关标签为特点。请确保保持原文的意思。",
  },
  {
    name: "概念解释",
    prompt: "对以下名词进行解释",
  },
  {
    name: "文本优化",
    prompt:
      "请用简洁明了的语言，编辑以下段落，以改善其逻辑流程，消除任何印刷错误，并以中文作答。请务必保持文章的原意。",
  },
  {
    name: "笔记助理",
    prompt:
      "我希望你能充当一次讲座的笔记助手。你的任务是提供一个详细的笔记列表，其中包括来自讲座的例子，并专注于你认为最有可能出现在测试题中的笔记。此外，请为具有数字和数据的笔记制作一个单独的列表，另外再制作一个包括在这次讲座中的例子的单独列表。这些笔记应该简明易读。",
  },
  {
    name: "情绪分析",
    prompt: "指定以下文字的情感，赋予它们的值为：正面、中性或负面。",
  },
  {
    name: "数据分析",
    prompt:
      "对以下数据进行解读，包括但不限于数据变化趋势、数据摘要和描述、数据关联和相关性、数据分布和频率、数据时序和趋势、数据群体和样本、数据异常和离群值、数据可视化和呈现，以及最终的解读和结论等",
  },
];
